### WED 05-09-2018

In [163]:
  
### R prog is also used for data analysisi
### Pandas is a data analysis tool

In [5]:
# primitive  object in the pandas 
"""1.) series 1D
2.) Dataframe 2D
3.) Pannel 3D
4.) Panel4   4D
"""

'1.) series 1D\n2.) Dataframe 2D\n3.) Pannel 3D\n4.) Panel4   4D\n'

In [4]:
import pandas as pd

In [16]:
# creating the series data type in pandas
# we can also get the index by ourself
my_series = pd.Series([1,2,3,34,34], index =["jan","feb","march","april" ,"jun"])

In [31]:
my_series.index.max()

'march'

In [32]:
### Dataframe is a 2D array it is the most useful pandas object 
#### it is also homogenous and it is non-mutable 
### we can tabulraise the datay

In [34]:
dataframe = pd.DataFrame([1,2,3,3,7,76,44,67])

<h4>Series  =  list + index</h4>
<br>Dataframe    =   Dict + index

In [37]:
'''
Ways to create the dataframe 
1.) csv (comma seperable values)
2.) excel sheet 
3.) dict
4.) list
'''

'\nWays to create the dataframe \n1.) csv (comma seperable values)\n2.) excel sheet \n3.) dict\n4.) list\n'

In [38]:
import pandas as pd

In [54]:
mydf = pd.DataFrame({"Name": ["pulkit" ,"yogesh", "vishal"] , "Age" :[12,12,12], "Gender" : ["male","male","male"]}, index =['a', 'b', 'c'])

In [55]:
mydf

   Age Gender    Name
a   12   male  pulkit
b   12   male  yogesh
c   12   male  vishal

In [58]:
mydf.ndim

2

In [60]:
# the length of the 2D array is number of the columns 
len(mydf)

3

In [65]:
mydf.Name

a    pulkit
b    yogesh
c    vishal
Name: Name, dtype: object

In [90]:
# if index is integer iloc  
# if index is number loc
mydf.loc["a"]
mydf.iloc[0:2]

   Age Gender    Name
a   12   male  pulkit
b   12   male  yogesh

### Reading the excel file in pandas

In [92]:
import pandas as pd

In [122]:
test_data = pd.read_excel(r'C:/Users/student711/Desktop/pulkit/DataSets-master/DataSets-master/Test_Data.xlsx')

In [141]:
test_data.keys()

Index(['account', 'name', 'street', 'city', 'state', 'postal-code', 'Jan',
       'Feb', 'Mar'],
      dtype='object')

In [142]:
test_data.columns

Index(['account', 'name', 'street', 'city', 'state', 'postal-code', 'Jan',
       'Feb', 'Mar'],
      dtype='object')

In [161]:
test_data["Total"] = test_data["Jan"] + test_data["Feb"] + test_data["Mar"]

In [166]:
test_data[test_data["Total"] == test_data["Total"].max()]

,account,name,street,city,state,postal-code,Jan,Feb,Mar,Total
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000,340000

In [167]:
test_data[test_data["Total"] == test_data["Total"].min()]

,account,name,street,city,state,postal-code,Jan,Feb,Mar,Total
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000,107000

In [168]:
test_data[test_data["Jan"] == test_data["Jan"].min()]

,account,name,street,city,state,postal-code,Jan,Feb,Mar,Total
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000,107000

In [173]:
test_data["Jan"].sum()

1462000

In [200]:
test_data.iloc[::-1,::-1]

,Total,Mar,Feb,Jan,postal-code,state,city,street,name,account
14,340000,70000,120000,150000,27933,Delaware,Kathryneborough,8917 Bergstrom Meadow,McDermott PLC,273274
13,210000,35000,120000,55000,31919,RhodeIsland,Goodwinmouth,2624 Beatty Parkways,Walsh-Haley,268755
12,317000,35000,120000,162000,72686,Iowa,East Davian,182 Bertie Road,"Frami, Anderson and Donnelly",242368
11,322000,162000,10000,150000,31415,NorthDakota,Norbertomouth,18115 Olivine Throughway,Hahn-Moore,231907
10,220000,55000,120000,45000,47743,Tenessee,Rosaberg,649 Cierra Forks Apt. 078,"Goodwin, Homenick and Jerde",214098
9,225000,35000,120000,70000,46308,Idaho,North Ras,366 Maggio Grove Apt. 998,Gerhold-Maggio,212303
8,200000,35000,95000,70000,64415,Pennsylvania,Lake Juliannton,26739 Grant Lock,Champlin-Morar,209744
7,275000,35000,95000,145000,53461,RhodeIsland,Deronville,91971 Cronin Vista Suite 601,Kovacek-Johnston,205217
6,252000,70000,120000,62000,18008,Mississipi,Lake Gabriellaton,340 Consuela Bridge Apt. 400,Casper LLC,145068
5,305000,35000,120000,150000,62785,Arkansas,Jeremieburgh,89403 Casimer Spring,"Williamson, Schumm and Hettinger",132971
4,317000,35000,120000,162000,49681,California,Shanahanchester,7274 Marissa Common,Bauch-Goldner,121213
3,175000,10000,120000,45000,46021,Maine,Hyattburgh,155 Fadel Crescent Apt. 144,"D'Amore, Gleichner and Bode",109996
2,246000,35000,120000,91000,76517,Iowa,New Lilianland,62184 Schamberger Underpass Apt. 231,"Bashirian, Kunde and Price",648336
1,175000,35000,45000,95000,38365,NorthCarolina,Port Khadijah,1311 Alvis Tunnel,Walter-Trantow,320563
0,107000,35000,62000,10000,28752,Texas,New Jaycob,34456 Sean Highway,"Kerluke, Koepp and Hilpert",211829

In [202]:
test_data.info

<bound method DataFrame.info of     account                              name  \
0    211829        Kerluke, Koepp and Hilpert
1    320563                    Walter-Trantow
2    648336        Bashirian, Kunde and Price
3    109996       D'Amore, Gleichner and Bode
4    121213                     Bauch-Goldner
5    132971  Williamson, Schumm and Hettinger
6    145068                        Casper LLC
7    205217                  Kovacek-Johnston
8    209744                    Champlin-Morar
9    212303                    Gerhold-Maggio
10   214098       Goodwin, Homenick and Jerde
11   231907                        Hahn-Moore
12   242368      Frami, Anderson and Donnelly
13   268755                       Walsh-Haley
14   273274                     McDermott PLC

                                  street               city          state  \
0                     34456 Sean Highway         New Jaycob          Texas
1                      1311 Alvis Tunnel      Port Khadijah  NorthCarolina
2   62184 Schamberger Underpass Apt. 231     New Lilianland           Iowa
3            155 Fadel Crescent Apt. 144         Hyattburgh          Maine
4                    7274 Marissa Common    Shanahanchester     California
5                   89403 Casimer Spring       Jeremieburgh       Arkansas
6           340 Consuela Bridge Apt. 400  Lake Gabriellaton     Mississipi
7           91971 Cronin Vista Suite 601         Deronville    RhodeIsland
8                       26739 Grant Lock    Lake Juliannton   Pennsylvania
9              366 Maggio Grove Apt. 998          North Ras          Idaho
10             649 Cierra Forks Apt. 078           Rosaberg       Tenessee
11              18115 Olivine Throughway      Norbertomouth    NorthDakota
12                       182 Bertie Road        East Davian           Iowa
13                  2624 Beatty Parkways       Goodwinmouth    RhodeIsland
14                 8917 Bergstrom Meadow    Kathryneborough       Delaware

    postal-code     Jan     Feb     Mar   Total
0         28752   10000   62000   35000  107000
1         38365   95000   45000   35000  175000
2         76517   91000  120000   35000  246000
3         46021   45000  120000   10000  175000
4         49681  162000  120000   35000  317000
5         62785  150000  120000   35000  305000
6         18008   62000  120000   70000  252000
7         53461  145000   95000   35000  275000
8         64415   70000   95000   35000  200000
9         46308   70000  120000   35000  225000
10        47743   45000  120000   55000  220000
11        31415  150000   10000  162000  322000
12        72686  162000  120000   35000  317000
13        31919   55000  120000   35000  210000
14        27933  150000  120000   70000  340000  >

In [208]:
test_data.describe

<bound method NDFrame.describe of     account                              name  \
0    211829        Kerluke, Koepp and Hilpert
1    320563                    Walter-Trantow
2    648336        Bashirian, Kunde and Price
3    109996       D'Amore, Gleichner and Bode
4    121213                     Bauch-Goldner
5    132971  Williamson, Schumm and Hettinger
6    145068                        Casper LLC
7    205217                  Kovacek-Johnston
8    209744                    Champlin-Morar
9    212303                    Gerhold-Maggio
10   214098       Goodwin, Homenick and Jerde
11   231907                        Hahn-Moore
12   242368      Frami, Anderson and Donnelly
13   268755                       Walsh-Haley
14   273274                     McDermott PLC

                                  street               city          state  \
0                     34456 Sean Highway         New Jaycob          Texas
1                      1311 Alvis Tunnel      Port Khadijah  NorthCarolina
2   62184 Schamberger Underpass Apt. 231     New Lilianland           Iowa
3            155 Fadel Crescent Apt. 144         Hyattburgh          Maine
4                    7274 Marissa Common    Shanahanchester     California
5                   89403 Casimer Spring       Jeremieburgh       Arkansas
6           340 Consuela Bridge Apt. 400  Lake Gabriellaton     Mississipi
7           91971 Cronin Vista Suite 601         Deronville    RhodeIsland
8                       26739 Grant Lock    Lake Juliannton   Pennsylvania
9              366 Maggio Grove Apt. 998          North Ras          Idaho
10             649 Cierra Forks Apt. 078           Rosaberg       Tenessee
11              18115 Olivine Throughway      Norbertomouth    NorthDakota
12                       182 Bertie Road        East Davian           Iowa
13                  2624 Beatty Parkways       Goodwinmouth    RhodeIsland
14                 8917 Bergstrom Meadow    Kathryneborough       Delaware

    postal-code     Jan     Feb     Mar   Total
0         28752   10000   62000   35000  107000
1         38365   95000   45000   35000  175000
2         76517   91000  120000   35000  246000
3         46021   45000  120000   10000  175000
4         49681  162000  120000   35000  317000
5         62785  150000  120000   35000  305000
6         18008   62000  120000   70000  252000
7         53461  145000   95000   35000  275000
8         64415   70000   95000   35000  200000
9         46308   70000  120000   35000  225000
10        47743   45000  120000   55000  220000
11        31415  150000   10000  162000  322000
12        72686  162000  120000   35000  317000
13        31919   55000  120000   35000  210000
14        27933  150000  120000   70000  340000  >